import math

#функція для перевірки значень х та розв'язку рівняння
def eq1(x):
    while x <= 0:
        x = int(input('Помилка: х не може бути меншим чи дорівнювати 0, введіть нове значення х: '))
    z = (2 * math.tan(x) - math.sqrt(x)) / x
    print('z = ', z)
    return z


#функція для вирішення суми всіх чисел від k до у, кратних числу 3.
def sol2(k, y):
    overall = 0
    for i in range(k, y + 1):
        if i % 3 == 0:
            overall += i
    print('Сума чисел кратних 3 від k до y = ', overall)
    return overall

x = int(input('Введіть значення х: '))

#виклик функції для перевірки х та розв'язку рівняння
eq1(x)

print()

#запит значень на функцію суми всіх чисел від k до у, кратних числу 3.
k = int(input('Введіть значення k: '))
y = int(input('Введіть значення y: '))
print()

#функція перевірки допустимих значень k та у
def check1(k, y):
    while  k >= y:
        print('Помилка: k має бути менше y')
        k = int(input('Введіть значення k: '))
        y = int(input('Введіть значення y: '))
        print()
    return sol2(k, y)

#виклик перевірки
check1(k, y)

#імпортований модуль
import module2 as m

#запит значень для функії з модуля
print()
c = int(input('Введіть значення c: '))
b = int(input('Введіть значення b: '))
print()

#перевірка допустимості значень модуля та вирішення суми всіх чисел від с до b кратних 3
result = m.check2(c, b)

print ('Сума кратних чисел 3 від с до b: ', result)

