#Литвиненко Анастасія
#КНд-41с
#Лаб 1, Варіант 10

#Завдання 1: Написати програму, яка обчислює значення X  в залежності від значень a та b, введених користувачем з клавіатури

a = int(input('Введіть значення змінної а (1 - 100): '))

while (a < 1 or a > 100):

    a = int(input ("Помилка! Введіть а  (1 - 100): "))

b = int(input('Введіть значення змінної "b": '))

while (b < 1 or b > 100):

    b = int(input ("Помилка! Введіть b  (1 - 100): "))

print ('Ваші змінні: а =', a, 'b =', b)

if a > b:
    answer = a / b + 31
elif a == b:
    answer = 25
else:
    answer = a * 5 - 1
print ('Відповідь = ', answer)
print()


#Завдання 2: Знайти та вивести на екран у вигляді таблиці значення функції у=х при х=[0..4] з кроком 0.5.

print('Значення функції у=х при х=[0..4] з кроком 0.5: ')
for x in range(0, 9, 1):
    x/=2
    y = x
    print('x =', x, 'y =', y)
print()


#Завдання 3: Вводиться ціле число N (1<N<9), а виводяться рядки з числами або іншими символами (*, #), які утворюють визначений «рисунок» (останній задається варіантом).

n = int(input('Введіть число від 2 до 8 включно: '))

#перевірка допустимих значень
while (n < 1 or n > 8):
    n = int(input(('Помилка! Введіть номер у правильному діапазоні (2-8): ')))

#верхня частина малюнку
for i in range(1, n + 1):
    print (' ' * n, end= '')
    num = n
    for j in range(n, 0, -1):
        if j > i:
            num -= 1
        else:
            print(num, end='')
            num -= 1
    print()
            
#нижня частина малюнку
for i in range(1, n + 1): 
    print(' ' * (i - 1), end='')
    num = 1 
    for j in range (n, 0, -1): 
        if j >= i: 
            print(num, end='')
            num += 1 
    print()



