import pandas as pd

#робимо датафрейм
df = pd.DataFrame({'школа': [654, 763, 583, 762], 'технікум': [469, 875, 842, 731], 'училище': [953, 756, 843, 202], 'ліцей': [492, 752, 832, 465]})

#виводимо на екран
print(df)

#робимо різні дії над датафреймом
print('\nПерші три рядки: ', df.head(3))
print('\nТипи даних: ', df.dtypes)
print('\nКількість рядків і стовпців: ', df.shape)
print('\nОписова статистика: ', df.describe())

print('\nДодаємо повну кількість учнів у різних типах навчальних закладів у рядок під індексом 4...')
df.loc[len(df)] = [df['школа'].sum(), df['технікум'].sum(), df['училище'].sum(), df['ліцей'].sum()]
print('\n', df)

print('\nМаксимальна кількість учнів у ліцеях: ', df['ліцей'].loc[0:3].max())
print('\nМінімальна кількість учнів у школах: ', df['школа'].loc[0:3].min())
print('\nСереднє значення учнів, які навчаються у технікуме: ', df['технікум'].loc[0:3].mean())

#сортуємо
df_sort= df.sort_values(by = df.columns.tolist())

print('\n\nВідсортована дата базa по зрозстанню: \n', df_sort)

#групуємо за індексом
print('\nГрупування по індексу: ')
df['type'] = ['A', 'B', 'C', 'A', 'B']
dcc = df.loc[0:3] #не беремо останній рядок, де була написана сума
df_group = dcc.groupby('type').sum()
print(df_group)
print('\n')
